<a href="https://colab.research.google.com/github/Hkherdekar/PoC-reposity/blob/master/FutureSalesPrediction1CCompany.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#importing libraries

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [0]:
#importing data and converting to pandas dataframe

url = 'https://raw.githubusercontent.com/VallabhK/ExperimentsWithData/master/Input/sales_train.csv'
salestrain = pd.read_csv(url);

In [4]:
#checking imported data
salestrain.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [0]:
#splitting date into day, month and year
new = salestrain['date'].str.split(".", expand = True) 

#creating new columns to store date
salestrain['day'] = new[0]
salestrain['month'] = new[1]
salestrain['year'] = new[2]

In [7]:
salestrain.head()

         date  date_block_num  shop_id  item_id  ...  item_cnt_day  day month  year
0  02.01.2013               0       59    22154  ...           1.0   02    01  2013
1  03.01.2013               0       25     2552  ...           1.0   03    01  2013
2  05.01.2013               0       25     2552  ...          -1.0   05    01  2013
3  06.01.2013               0       25     2554  ...           1.0   06    01  2013
4  15.01.2013               0       25     2555  ...           1.0   15    01  2013

[5 rows x 9 columns]

https://databricks.com/product/faq/community-edition


https://zoom.us/download

https://www.kaggle.com/jagangupta/time-series-basics-exploring-traditional-ts